/*
	½Ótextin03.cpp
	
	C++ cin¶ÔÏóÓĞÒ»¸öºÍCÖĞgetchar()º¯ÊıÏàÍ¬¹¤×÷·½Ê½µÄ³ÉÔ±º¯Êı£¬¼´cin.get()¡£
	ÔÚÊ¹ÓÃch = cin.get()Ìæ»»cin.get(ch)Ê±£¬´ó¶àÊıÇé¿öÊÇÃ»²î±ğµÄ£»µ«ÔÚ´¦ÀíEOFÌõ¼şÊ±£¬cin.get()·µ»ØµÄ×Ö·ûÃ»ÓĞ¿ÉÒÔºÍ
	EOF¶ÔÓ¦µÄ¡£C++µÄ´¦Àí·½Ê½ÊÇ£¬cin.get()»á·µ»ØÒ»¸öÓÃ·ûºÅ³£Á¿EOF±íÊ¾µÄÌØÊâÖµ£¬¸ÃÖµ²»µÈÓÚÈÎºÎÒ»¸öÓĞĞ§µÄ×Ö·ûÖµ¡£Òò´Ë£¬
	Í¨³£½«¸ÃÖµÉèÖÃÎª-1£¬ÒòÎªASCIIÖĞ²»´æÔÚ-1µÄÖµ¡£ÕâÒ²µ¼ÖÂÉùÃ÷±äÁ¿chÊ±ĞèÒªÓÃintÀàĞÍ£¬¶ø²»ÊÇcharÀàĞÍ¡£ÕâÊÇÎªÁË±ÜÃâ
	ÓĞĞ©ÏµÍ³ÖĞcharÀàĞÍÄ¬ÈÏÊÇÃ»ÓĞ·ûºÅµÄ£¬´Ó¶øÎŞ·¨½«·Ç¸ºÖµchºÍ¶¨ÒåÎª-1µÄ·ûºÅ³£Á¿EOF»®µÈºÅ¡£Àı×ÓÈçÏÂ£º
		char ch; // Ä³Ğ©ÏµÍ³ÖĞ£¬charÀàĞÍÄ¬ÈÏÎªunsigned char
		ch = cin.get(); // µ±Åöµ½EOFÌõ¼şÊ±£¬cin.get()·µ»Ø·ûºÅ³£Á¿EOF´ú±íµÄÖµ£¬Í¨³£Îª-1£¬ÕâÒâÎ¶×ÅÖµÎª-1µÄint×ÖÃæÖµ±»
						// ¸³¸øunsigned char±äÁ¿ch£¬chµÄÖµ½«µÈÓÚ255
		while(ch != EOF) // ´ËÊ±£¬Ñ­»·½øÈëÌõ¼şch != EOFÓÉÓÚÖ´ĞĞµÄÊÇunsigned charºÍintµÄ±È½Ï£¬Ö´ĞĞ×Ô¶¯ÀàĞÍ×ª»»Ê±½«ch
						 // ÌáÉıÎªintÀàĞÍ£¬unsigned charÀàĞÍµÄ255±äÎªintÀàĞÍµÄ255, ºÍintÀàĞÍµÄEOF£¨ÖµÎª-1£©±È½Ï£¬µ±
						 // È»½á¹ûÊÇ²»µÈÓÚ£¬´Ó¶øÑ­»·ÈÔ»á½øÈë¡£´ï²»µ½¡°Åöµ½EOFÌõ¼şÔòÍ£Ö¹´¦ÀíÊäÈë¡±µÄĞ§¹û
		{
			...
		}
	Ïà·´£¬Èç¹û½«ch¶¨ÒåÎªintÀàĞÍ£¬ÔòÓï¾äch = cin.get()ºÍ±í´ïÊ½ch != EOF¶¼²»»áÓĞÒşÊ½ÀàĞÍ×ª»»£¬´Ó¶øÔÚÓöµ½EOFÌõ¼şÊ±ch±»
	ÕıÈ·¸³ÖµÎª-1£¬ÔÚÖ´ĞĞÑ­»·Ìõ¼şÅĞ¶ÏÊ±Ë³ÀûÍË³öÑ­»·¡£
		
*/

#include <iostream>
using namespace std;

int main()
{
	char ch;
	ch = cin.get();  // ÕâÀïÊäÈëCtrl+Z EnterÄ£ÄâEOFÌõ¼ş
	cout << (ch & 0xff) << endl;  // Êä³ö255£¬ËµÃ÷chµÄ¶ş½øÖÆ±íÊ¾Îª1000 0000
	cout << (EOF & 0xff) << endl; // Êä³ö255£¬ËµÃ÷EOFµÄ¶ş½øÖÆ±íÊ¾Ò²Îª1000 0000

	cout << ch << endl; // ÎŞÊä³ö£¬ÕâÒâÎ¶×ÅÃ»ÓĞ¶ÔÓ¦µÄASCII×Ö·û»òÕßÊÇ²»¿É´òÓ¡×Ö·û£¿
	cout << (int)ch << endl; // Ç¿ÖÆ×ª»»ÎªintÀàĞÍÊä³öÎª-1
	cout << EOF << endl; // Êä³ö-1£¬ËµÃ÷EOFÖµÎª-1
	bool flag = (ch == EOF); // flagÎªtrue£¬ËµÃ÷chºÍEOF±È½ÏÊ±£¬chÖ´ĞĞ×Ô¶¯ÀàĞÍ×ª»»µÃµ½µÄÊÇÖµÎª-1µÄintÖµ¶ø·ÇÖµÎª255
							 // Õâ¿ÉÒÔ½âÊÍÎª£¬±¾»úµÄcharÀàĞÍÄ¬ÈÏÎªsigned char£¬¶øsigned charÌáÉıÎªintÀàĞÍÊ±£¬Ö´ĞĞ
							 // µÄÊÇ·ûºÅÀ©Õ¹£»¶øunsigned charÌáÉıÎªintÀàĞÍÊ±£¬Ö´ĞĞµÄÊÇÎŞ·ûºÅÍØÕ¹							 
	cout << flag << endl;

	cout << "-------------------------------------------------\n";

	// ÑéÖ¤ÒÔÏÂÉÏÃæ¹ØÓÚÓĞ·ûºÅ/ÎŞ·ûºÅÀ©Õ¹µÄÍÆ²â
	signed char ch01 = 0xff;
	unsigned char ch02 = 0xff;
	char ch00 = 0xff;
	cout << (int)ch01 << ", " << ((int)ch01 & 0xffffffff) << endl; // Ô¤ÆÚÊä³ö£º-1, 4294967295
	cout << (int)ch02 << ", " << ((int)ch02 & 0xffffffff) << endl; // Ô¤ÆÚÊä³ö£º255, 255
	cout << (int)ch00 << ", " << ((int)ch00 & 0xffffffff) << endl; // Ô¤ÆÚÊä³ö£º-1, 4294967295
	/*
		Êµ¼ÊÊä³ö·ûºÏÔ¤ÆÚ¡£
		±È½ÏÁ½´ÎÊä³öµÄµÚ¶ş¸öÖµ£º
		4294967295¶ÔÓ¦Ê®Áù½øÖÆ0xffff ffff ffff ffff, ËµÃ÷(int)ch01Ö´ĞĞµÄÊÇ·ûºÅÎ»À©Õ¹
		255¶ÔÓ¦Ê®Áù½øÖÆ0x0000 0000 0000 00ff, ËµÃ÷(int)ch02Ö´ĞĞµÄÊÇÎŞ·ûºÅÀ©Õ¹£¨0À©Õ¹£©
		
		µÚÈıĞĞÊä³öºÍµÚÒ»ĞĞÏàÍ¬£¬ËµÃ÷ÏµÍ³ÄÚ²¿char¾ÍÊÇsigned char
	*/
	
	cout << "-------------------------------------------------\n";

	int chh;
	cin.clear(); // ÏÂÃæ½øĞĞÁíÒ»¸ö²âÊÔ£¬ÔÚ´ËÖ®Ç°£¬ĞèÒªÖØÖÃÊäÈëÁ÷£¬ÒòÎªÖ®Ç°´¦Àí¹ıEOFµ¼ÖÂÊäÈëÁ÷¹Ø±ÕÁË¡£
	chh = cin.get();
	cout.put(chh); // Êé±¾ÉÏËµchÉùÃ÷ÎªintÔòÊä³ö×Ö·ûÊ±±ØĞëÊ¹ÓÃcin.put(char(chh)); ÊÔÊÔ²»½øĞĞÇ¿ÖÆÀàĞÍ×ª»»»áÔõÑù
				   // ²âÊÔ½á¹û±íÃ÷²»½øĞĞ×ª»»Ò²¿ÉĞĞ
	//cout.put(char(chh));



	/*
		ÏÂÃæÊÇµ±Ç°ÎÄ¼ş²âÊÔÊ±Õû¸öµÄÊä³ö£º
			^Z							// ¼üÅÌÊäÈë
			255
			255
			ÿ
			-1
			-1
			1
			-------------------------------------------------
			-1, 4294967295
			255, 255
			-1, 4294967295
			-------------------------------------------------
			A							// ¼üÅÌÊäÈë
			A
		
	*/
}